bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/ef_ctrl_reg.h
/* 0xA04 : ef_crc_ctrl_1 */
#define EF_CTRL_EF_CRC_CTRL_1_OFFSET  (0xA04)
#define EF_CTRL_EF_CRC_DATA_0_EN      EF_CTRL_EF_CRC_DATA_0_EN
#define EF_CTRL_EF_CRC_DATA_0_EN_POS  (0U)
#define EF_CTRL_EF_CRC_DATA_0_EN_LEN  (32U)
#define EF_CTRL_EF_CRC_DATA_0_EN_MSK  (((1U << EF_CTRL_EF_CRC_DATA_0_EN_LEN) - 1) << EF_CTRL_EF_CRC_DATA_0_EN_POS)
#define EF_CTRL_EF_CRC_DATA_0_EN_UMSK (~(((1U << EF_CTRL_EF_CRC_DATA_0_EN_LEN) - 1) << EF_CTRL_EF_CRC_DATA_0_EN_POS))

/* 0xA08 : ef_crc_ctrl_2 */
#define EF_CTRL_EF_CRC_CTRL_2_OFFSET  (0xA08)
#define EF_CTRL_EF_CRC_DATA_1_EN      EF_CTRL_EF_CRC_DATA_1_EN
#define EF_CTRL_EF_CRC_DATA_1_EN_POS  (0U)
#define EF_CTRL_EF_CRC_DATA_1_EN_LEN  (32U)
#define EF_CTRL_EF_CRC_DATA_1_EN_MSK  (((1U << EF_CTRL_EF_CRC_DATA_1_EN_LEN) - 1) << EF_CTRL_EF_CRC_DATA_1_EN_POS)
#define EF_CTRL_EF_CRC_DATA_1_EN_UMSK (~(((1U << EF_CTRL_EF_CRC_DATA_1_EN_LEN) - 1) << EF_CTRL_EF_CRC_DATA_1_EN_POS))

/* 0xA0C : ef_crc_ctrl_3 */
#define EF_CTRL_EF_CRC_CTRL_3_OFFSET (0xA0C)
#define EF_CTRL_EF_CRC_IV            EF_CTRL_EF_CRC_IV
#define EF_CTRL_EF_CRC_IV_POS        (0U)
#define EF_CTRL_EF_CRC_IV_LEN        (32U)
#define EF_CTRL_EF_CRC_IV_MSK        (((1U << EF_CTRL_EF_CRC_IV_LEN) - 1) << EF_CTRL_EF_CRC_IV_POS)
#define EF_CTRL_EF_CRC_IV_UMSK       (~(((1U << EF_CTRL_EF_CRC_IV_LEN) - 1) << EF_CTRL_EF_CRC_IV_POS))

/* 0xA10 : ef_crc_ctrl_4 */
#define EF_CTRL_EF_CRC_CTRL_4_OFFSET (0xA10)
#define EF_CTRL_EF_CRC_GOLDEN        EF_CTRL_EF_CRC_GOLDEN
#define EF_CTRL_EF_CRC_GOLDEN_POS    (0U)
#define EF_CTRL_EF_CRC_GOLDEN_LEN    (32U)
#define EF_CTRL_EF_CRC_GOLDEN_MSK    (((1U << EF_CTRL_EF_CRC_GOLDEN_LEN) - 1) << EF_CTRL_EF_CRC_GOLDEN_POS)
#define EF_CTRL_EF_CRC_GOLDEN_UMSK   (~(((1U << EF_CTRL_EF_CRC_GOLDEN_LEN) - 1) << EF_CTRL_EF_CRC_GOLDEN_POS))

/* 0xA14 : ef_crc_ctrl_5 */
#define EF_CTRL_EF_CRC_CTRL_5_OFFSET (0xA14)
#define EF_CTRL_EF_CRC_DOUT          EF_CTRL_EF_CRC_DOUT
#define EF_CTRL_EF_CRC_DOUT_POS      (0U)
#define EF_CTRL_EF_CRC_DOUT_LEN      (32U)
#define EF_CTRL_EF_CRC_DOUT_MSK      (((1U << EF_CTRL_EF_CRC_DOUT_LEN) - 1) << EF_CTRL_EF_CRC_DOUT_POS)
#define EF_CTRL_EF_CRC_DOUT_UMSK     (~(((1U << EF_CTRL_EF_CRC_DOUT_LEN) - 1) << EF_CTRL_EF_CRC_DOUT_POS))

struct ef_ctrl_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[2048];

    /* 0x800 : ef_if_ctrl_0 */
    union {
        struct
        {
            uint32_t ef_if_0_autoload_p1_done : 1; /* [    0],          r,        0x1 */
            uint32_t ef_if_0_autoload_done    : 1; /* [    1],          r,        0x1 */
            uint32_t ef_if_0_busy             : 1; /* [    2],          r,        0x0 */
            uint32_t ef_if_0_rw               : 1; /* [    3],        r/w,        0x0 */
            uint32_t ef_if_0_trig             : 1; /* [    4],        r/w,        0x0 */
            uint32_t ef_if_0_manual_en        : 1; /* [    5],        r/w,        0x0 */
            uint32_t ef_if_0_cyc_modify       : 1; /* [    6],        r/w,        0x0 */
            uint32_t ef_clk_sahb_data_sel     : 1; /* [    7],        r/w,        0x0 */
            uint32_t ef_if_prot_code_ctrl     : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t ef_if_por_dig            : 1; /* [   16],        r/w,        0x0 */
            uint32_t ef_clk_sahb_data_gate    : 1; /* [   17],        r/w,        0x0 */
            uint32_t ef_if_auto_rd_en         : 1; /* [   18],        r/w,        0x1 */
            uint32_t ef_if_cyc_modify_lock    : 1; /* [   19],        r/w,        0x0 */
            uint32_t ef_if_0_int              : 1; /* [   20],          r,        0x0 */
            uint32_t ef_if_0_int_clr          : 1; /* [   21],        r/w,        0x1 */
            uint32_t ef_if_0_int_set          : 1; /* [   22],        r/w,        0x0 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t ef_if_prot_code_cyc      : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_ctrl_0;

    /* 0x804 : ef_if_cyc_0 */
    union {
        struct
        {
            uint32_t ef_if_cyc_rd_dmy  : 6; /* [ 5: 0],        r/w,        0x0 */
            uint32_t ef_if_cyc_rd_dat  : 6; /* [11: 6],        r/w,        0x1 */
            uint32_t ef_if_cyc_rd_adr  : 6; /* [17:12],        r/w,        0x0 */
            uint32_t ef_if_cyc_cs      : 6; /* [23:18],        r/w,        0x0 */
            uint32_t ef_if_cyc_pd_cs_s : 8; /* [31:24],        r/w,       0x16 */
        } BF;
        uint32_t WORD;
    } ef_if_cyc_0;

    /* 0x808 : ef_if_cyc_1 */
    union {
        struct
        {
            uint32_t ef_if_cyc_pi      : 6; /* [ 5: 0],        r/w,        0x9 */
            uint32_t ef_if_cyc_pp      : 8; /* [13: 6],        r/w,       0x98 */
            uint32_t ef_if_cyc_wr_adr  : 6; /* [19:14],        r/w,        0x1 */
            uint32_t ef_if_cyc_ps_cs   : 6; /* [25:20],        r/w,        0x2 */
            uint32_t ef_if_cyc_pd_cs_h : 6; /* [31:26],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_cyc_1;

    /* 0x80C : ef_if_0_manual */
    union {
        struct
        {
            uint32_t ef_if_a                : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t ef_if_pd               : 1;  /* [   10],        r/w,        0x1 */
            uint32_t ef_if_ps               : 1;  /* [   11],        r/w,        0x0 */
            uint32_t ef_if_strobe           : 1;  /* [   12],        r/w,        0x0 */
            uint32_t ef_if_pgenb            : 1;  /* [   13],        r/w,        0x1 */
            uint32_t ef_if_load             : 1;  /* [   14],        r/w,        0x1 */
            uint32_t ef_if_csb              : 1;  /* [   15],        r/w,        0x1 */
            uint32_t ef_if_0_q              : 8;  /* [23:16],          r,        0x0 */
            uint32_t ef_if_prot_code_manual : 8;  /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_0_manual;

    /* 0x810 : ef_if_0_status */
    union {
        struct
        {
            uint32_t ef_if_0_status : 32; /* [31: 0],          r,     0xe400 */
        } BF;
        uint32_t WORD;
    } ef_if_0_status;

    /* 0x814 : ef_if_cfg_0 */
    union {
        struct
        {
            uint32_t ef_if_sf_aes_mode     : 2; /* [ 1: 0],          r,        0x0 */
            uint32_t ef_if_sboot_sign_mode : 2; /* [ 3: 2],          r,        0x0 */
            uint32_t ef_if_sboot_en        : 2; /* [ 5: 4],          r,        0x0 */
            uint32_t ef_if_cpu1_enc_en     : 1; /* [    6],          r,        0x0 */
            uint32_t ef_if_cpu0_enc_en     : 1; /* [    7],          r,        0x0 */
            uint32_t ef_if_boot_sel        : 4; /* [11: 8],          r,        0x0 */
            uint32_t ef_if_sf_key_0_sel    : 2; /* [13:12],          r,        0x0 */
            uint32_t ef_if_sdu_dis         : 1; /* [   14],          r,        0x0 */
            uint32_t ef_if_ble_dis         : 1; /* [   15],          r,        0x0 */
            uint32_t ef_if_wifi_dis        : 1; /* [   16],          r,        0x0 */
            uint32_t ef_if_0_key_enc_en    : 1; /* [   17],          r,        0x0 */
            uint32_t ef_if_cam_dis         : 1; /* [   18],          r,        0x0 */
            uint32_t ef_if_m154_dis        : 1; /* [   19],          r,        0x0 */
            uint32_t ef_if_cpu1_dis        : 1; /* [   20],          r,        0x0 */
            uint32_t ef_if_cpu_rst_dbg_dis : 1; /* [   21],          r,        0x0 */
            uint32_t ef_if_se_dbg_dis      : 1; /* [   22],          r,        0x0 */
            uint32_t ef_if_efuse_dbg_dis   : 1; /* [   23],          r,        0x0 */
            uint32_t ef_if_dbg_jtag_1_dis  : 2; /* [25:24],          r,        0x0 */
            uint32_t ef_if_dbg_jtag_0_dis  : 2; /* [27:26],          r,        0x0 */
            uint32_t ef_if_dbg_mode        : 4; /* [31:28],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_if_cfg_0;

    /* 0x818 : ef_sw_cfg_0 */
    union {
        struct
        {
            uint32_t ef_sw_sf_aes_mode     : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t ef_sw_sboot_sign_mode : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t ef_sw_sboot_en        : 2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t ef_sw_cpu1_enc_en     : 1; /* [    6],        r/w,        0x0 */
            uint32_t ef_sw_cpu0_enc_en     : 1; /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_11         : 4; /* [11: 8],       rsvd,        0x0 */
            uint32_t ef_sw_sf_key_0_sel    : 2; /* [13:12],        r/w,        0x0 */
            uint32_t ef_sw_sdu_dis         : 1; /* [   14],        r/w,        0x0 */
            uint32_t ef_sw_ble_dis         : 1; /* [   15],        r/w,        0x0 */
            uint32_t ef_sw_wifi_dis        : 1; /* [   16],        r/w,        0x0 */
            uint32_t ef_sw_0_key_enc_en    : 1; /* [   17],        r/w,        0x0 */
            uint32_t ef_sw_cam_dis         : 1; /* [   18],        r/w,        0x0 */
            uint32_t ef_sw_m154_dis        : 1; /* [   19],        r/w,        0x0 */
            uint32_t ef_sw_cpu1_dis        : 1; /* [   20],        r/w,        0x0 */
            uint32_t ef_sw_cpu_rst_dbg_dis : 1; /* [   21],        r/w,        0x0 */
            uint32_t ef_sw_se_dbg_dis      : 1; /* [   22],        r/w,        0x0 */
            uint32_t ef_sw_efuse_dbg_dis   : 1; /* [   23],        r/w,        0x0 */
            uint32_t ef_sw_dbg_jtag_1_dis  : 2; /* [25:24],        r/w,        0x0 */
            uint32_t ef_sw_dbg_jtag_0_dis  : 2; /* [27:26],        r/w,        0x0 */
            uint32_t ef_sw_dbg_mode        : 4; /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } ef_sw_cfg_0;

